; ----------------------------------------------------------------------------
;
; Universal Extractor Language File
; Written for Universal Extractor 1.6
; Author:	Pruthisith (Terry) <pruthisith@msn.com>
;
; Translation Instructions:
;	Copy this file to a new file named after the new language
;		Eg: A language file for the German language would be named Deutsch.ini.
;	Replace the English words and phrases with their native equivalents,
;		attempting to match the English phrasing and case-sensitivity as
;		closely as possible for the sake of consistency
;	E-mail new language files to jbreland@legroom.net for inclusion in main
;		Universal Extractor installer
;
;	The following symbols have special meanings:
;	& - when used in a GUI label or button, it precedes the letter that will
;		be registered as a "hotkey" for that function
;	%n - indicates a newline character, which will be replaced when displayed
;	%t - indicates a tab character, which will be replaced when displayed
;	%s - indicates a string variable that UniExtract will replace when displayed
;		The contents each %s variables is hardocded into UniExtract.
;		The order and number of %s variables is very important and should not
;		be modified.
;
; ----------------------------------------------------------------------------

[UniExtract]
; GUI labels and buttons
OK_BUT = "&µЎЕ§"
CANCEL_BUT = "&ВЎаЕФЎ"
MAIN_DEST_DIR_LABEL = "&бїйБа»йТЛБТВ:"
MAIN_FILE_LABEL = "&дїЕмєХєНСґ/µСЗµФґµСй§·ХиµйН§ЎТГбµЎ:"
MENU_FILE_LABEL = "&дїЕм"
MENU_FILE_QUIT_LABEL = "&ННЎ"
MENU_EDIT_LABEL = "&бЎйдў"
MENU_EDIT_PREFS_LABEL = "&»ГСєбµи§ЁСґЎТГ"
MENU_HELP_LABEL = "&ЄиЗВаЛЕЧН"
MENU_HELP_WEB_LABEL = "%s &аЗзєд«·м"
PREFS_TITLE_LABEL = "»ГСєбµи§ЁСґЎТГ"
PREFS_UNIEXTRACT_OPTS_LABEL = "µСЗаЕЧНЎ Universal Extractor"
PREFS_HISTORY_LABEL = "&µФґµТБ»ГРЗСµФЎТГєХєНСґ"
PREFS_FORMAT_OPTS_LABEL = "µСЗаЕЧНЎГЩ»бєє-аЁТРЁ§"
PREFS_LANG_LABEL = "&АТЙТ"
PREFS_DEBUG_LABEL = "&бїйБўН§дїЕм Debug:"
PREFS_WARN_EXECUTE_LABEL = "&аµЧН№ЎиН№·ХидїЕмЁР·У§Т№"
PREFS_REMOVE_DUPE_LABEL = "&ЕєдїЕм«йУ"
PREFS_REMOVE_TEMP_LABEL = "ЕєдїЕмг№ &temporary"
PREFS_APPEND_EXT_LABEL = "&бЎйдўдїЕм·ХидБиБХ№ТБКЎШЕ"
METHOD_ADMIN_RADIO = "ЎТГµФґµСй§бєєјЩйЁСґЎТГГРєє"
METHOD_EXTRACTION_RADIO = "ЎТГбµЎдїЕм"
METHOD_HEADER = "бµЎдїЕмд»бЕйЗ %s"
METHOD_MSI_NOTE_LABEL = "б№Р№У:"
METHOD_MSI_REQUIRES_LABEL = "msi2xml µйН§гЄй"
METHOD_MSI_URL_LABEL = "MSXML 4.0 Parser"
METHOD_RADIO_LABEL = "ЗФёХЎТГбµЎдїЕм"
METHOD_SWITCH_RADIO = "а»ЕХиВ№"
METHOD_NOTIS_RADIO = "дБигЄиµСЗµФґµСй§ўН§ InstallShield"
METHOD_TEXT_LABEL = "%s ГН§ГСєЎТГбµЎдїЕмµТБґйТ№ЕиТ§№ХйаѕЧиНЎТГбµЎбѕз¤аЎЁўН§ %s , бµиНВиТ§дГЎзµТБЗФёХбµЎдїЕмаЛЕиТ№ХйдБиКТБТГ¶аЄЧиНдґй 100%, ¶йТЛТЎЗиТЗФёХ·ХиаЕЧНЎ№Сй№дБиКТБТГ¶·У§Т№дґй¶ЩЎµйН§гЛй·УЎТГГС№ %s НХЎ¤ГСй§бЕСаЕЧНЎЗФёХНЧи№"
METHOD_UNPACKER_RADIO = "µСЗ¤ЕТВбѕк¤"
;METHOD_BYFILES_RADIO = ""
;METHOD_BYGROUPS_RADIO = ""

; GUI control functions
DOES_NOT_EXIST = "дБиѕє %n"
EXTRACT_TO = "бµЎдїЕмд»ВС§"
INVALID_DIR_SELECTED =  "%s дБигЄибїйБ·Хи¶ЩЎµйН§"
INVALID_FILE_SELECTED = "%s в»ГґаЕЧНЎдїЕм·Хи¶ЩЎµйН§"
OPEN_FILE = "а»ФґдїЕм"
SELECT_FILE = "аЕЧНЎдїЕм"
WRITE_TO = "аўХВ№д»ВС§"

; Common terms
TERM_ARCHIVE = "дїЕмµиТ§ж"
TERM_COMPRESSED = "дїЕм·Хи¶ЩЎєХєНСґ"
TERM_DISK = "ґФКЎм"
TERM_EBOOK = "ebook"
TERM_ECARD = "ecard"
TERM_ENCODED = "дїЕм·Хи¶ЩЎ encode"
TERM_EXECUTABLE = "µСЗ·У§Т№"
TERM_FAILED = "јФґѕЕТґ"
TERM_HELP = "дїЕмЄиЗВаЛЕЧН"
TERM_HOTFIX = "µСЗбЎйдў"
TERM_IMAGE = "ГЩ»"
TERM_INSTALLER = "µСЗµФґµСй§"
TERM_PACKAGE = "бѕк¤аЎЁ"
TERM_PATCH = "patch"
TERM_SFX = "µСЗбµЎдїЕмНСµФв№БСµФ"
TERM_STAGE = "ЕУґСє"
TERM_SUCCEEDED = "КУаГзЁ"
TERM_TESTING = "ЎУЕС§·ґКНє"
TERM_UNKNOWN = "дБи·ГТє"
TERM_UNPACKED = "бµЎННЎбЕйЗ"
TERM_UPDATER = "НС»аґ·"

; Status messages
SCANNING_FILE = "ЎУЕС§µГЗЁКНєдїЕмаѕЧиН¤й№ЛТЄ№ФґўН§дїЕм"
SCANNING_EXE = "ЎУЕС§µГЗЁКНєдїЕмґйЗВ %s "
EXTRACTING = "ЎУЕС§бµЎдїЕмЁТЎ:"
INIT_WAIT = "ЎУЕС§ГНµСЗµФґµСй§аѕЧиН·УЎТГµГЗЁ¤иТ%nв»ГґГН"

; Custom prompts
CONVERT_CDROM = "%s CD-ROM images дБиКТБТГ¶бµЎдїЕмдґйвґВµГ§  г№·Т§ЎЕСєЎС№, image №Хй%n ЁРШ¶ЩЎб»Е§а»з№ ISO CD-ROM image б·№, «Ци§ЁРКТБТГА·УЎТГбµЎдїЕмдґй%n%¤ШіµйН§ЎТГЁР·УµиНд»ЛГЧНдБи?%nб№Р№У: ЎТГЎГР·У№ХйЁРгЄйаЗЕТЛЕТВ№Т·Х"
CONVERT_CDROM_STAGE1_FAILED = "аЎФґўйНјФґѕЕТґ:  CD-ROM images дБиКТБТГ¶б»Е§дґй%n¶йТЛТЎЗиТ№Хиа»з№ BIN/CUE image в»ГґµГЗЁКНєЗиТдїЕм CUE №Сй№¶ЩЎГЩ»бєєЛГЧНдБи"
CONVERT_CDROM_STAGE2_FAILED = "аЎФґўйНјФґѕЕТґ:  ISO image №Сй№¶ЩЎКГйТ§ЁТЎ BIN/CUE image, бµиБС№дБиКТБТГ¶ЁР¶ЩЎб»Е§дґй%n¤ШіµйН§ЎТГЁРаЎзєдїЕм ISO дЗйµГЗЁКНєµиНдЛБ
CONVERT_BIN_MISSING = "аЎФґўйНјФґѕЕТґ: дБиѕє:%n%s\%s.%s%n%nГЗБ¶Ц§ %s.bin бЕР %s.cue дґйбЕРЁУа»з№µйН§гЄй§Т№"
INIT_COMPLETE = "ЎУЕС§аГФиБ·У§Т№ %s.  в»ГґННЎЁТЎµСЗµФґµСй§, ЁТЎ№Сй№¤иНВЎґ OK аѕЧиН·УµиНд»"
WISE_MSI_PROMPT = "б№Р№У:  ЗФёХЎТГ№ХйЁР·У§Т№дґйµиНаБЧиНµСЗµФґµСй§ Wise КУЛГСє Windows Installer packages дґй¶ЩЎГРєШаНТдЗй,%n¶йТЛТЎ Wise Installation Wizard аГФиБбЕРГН¤УКСи§ input, №Сй№б»ЕЗиТдїЕмµСЗ№Хй№Сй№дБи¶ЩЎГСєГН§%n  в»ГґННЎЁТЎµСЗµФґµСй§, бЕР %s ЁР·УЎТГЛВШґЎТГбµЎдїЕм%n%n¤ШіµйН§ЎТГЁР·УµиНд»ЛГЧНдБи?"
UNPACK_PROMPT = "дїЕм№Хйдґй¶ЩЎбѕк¤ґйЗВЎТГєХєНСЎбєє %s , бµидБиКТБТГ¶·УЎТГбµЎдїЕмдґй,%n№ХиНТЁЁа»з№аѕГТРЄ№ФґўН§дїЕм№Сй№дБи¶ЩЎГН§ГСє, ЛГХЧННТЁа»з№аѕГТР%n"дБиБХдїЕмг№ЎТГбµЎ.%n%n¤ШіµйН§ЎТГЁР¤ЕТВбѕк¤№Хйб·№ЛГЧНдБи?%n%nб№Р№У: дїЕЧ·Хи¶ЩЎ¤ЕТВННЎ№Сй№ЁР¶ЩЎµСй§ЄЧиНЗиТ:%n%s\%s_unpacked.%s"
UNPACK_FAILED = "аЎФґўйНјФґѕЕТґ: %s%nдБиКТБТГ¶¤ЕТВбѕк¤дґй"
WARN_EXECUTE = "¤УаµЧН№:  г№ЎТГ·ХиЁРбµЎдїЕм»ГРаА·№Хй№Сй№, дїЕмЁУа»з№·ХиЁРµйН§¶ЩЎаГХВЎ·У§Т№вґВµГ§,%n¶йТЛТЎЗиТ¤Ші·УµиНд», ¤УКСи§µиНд»№ХйЁР¶ЩЎ·У§Т№:%n%n%s%n%n¶йТЛТЎ¤ШіаЄЧиНЗиТдїЕм№ХйНТЁа»з№дїЕмНС№µГТВ, аГТЁРўНб№Р№УгЛй¤ШідБи·УЎТГµиНд»,%n¤ШіµйН§ЎТГЁР·УµиНд»ЎСєЎТГбµЎдїЕм№ХйЛГЧНдБи?"

; Help text
HELP_SUMMARY = "ЎТГбµЎдїЕмЁТЎдїЕЧєХєгґжЛГЧНЁТЎµСЗµФґµСй§"
HELP_SYNTAX = "%nЗФёХгЄй:  %s [/help] [filename [destination]]"
HELP_ARGUMENTS = "%n%nµСЗб»Г·ХиГН§ГСє:"
HELP_HELP = "%n     /help%t%tбКґ§ўйНБЩЕЎТГЄиЗВаЛЕЧН№Хй"
HELP_FILENAME = "%n     filename%tЄЧиНўН§дїЕЧ·ХиЁР·УЎТГбµЎ"
HELP_DESTINATION = "%n     destination%tбїйБ·ХиµйН§ЎТГЁРгЛйбµЎдїЕм"
HELP_SUB = "%n%nЎТГгйЄй /sub б·№ЄЧиНбїйБа»йТЛБТВЁРа»з№ЎТГКСи§%n%s аѕЧиН·УЎТГбµЎдїЕмд»ВС§ subdirectory ·Хи¶ЩЎµСй§дЗйЛЕС§ЁТЎдїЕЧєХєНСХґ"
HELP_EXAMPLE1 = "%n%nµСЗНВиТ§:"
HELP_EXAMPLE2 = "%n     %s c:\1\example.zip c:\test"
HELP_NOARGS = "%n%n·У§Т№вґВ %s дБиБХµСЗб»ГгґжЁР·УгЛйаЎФґ%nЎТГбКґ§Л№йТЁН¶ТБјЩйгЄй ЄЧиНдїЕм бЕР бїйБа»йТЛБТВ"

; Error messages
CANNOT_LOG = "%s ЎТГбµЎдїЕмдБиКТБТГ¶єС№·ЦЎдґй"
CANNOT_DEBUG = "К¶Т№·ХиКГйТ§дїЕм dubug, "%s", №Сй№дБиКТБТГ¶аўХВ№дґй%nбїйБ temp ўН§¤ШіЁР¶ЩЎгЄй§Т№б·№"
CANNOT_EXTRACT = "%s дБиКТБТГ¶бµЎдїЕмдґй%nЄ№ФґўН§дїЕЧдґй·ХидґйГСє¤ЧН: %s%n%nЎґ µЎЕ§ ¶йТЛТЎ¤ШіµйН§ЎТГЁРµГЗЁКНєдїЕЧґйЗВµСЗўН§¤ШіаН§, ЛГЧН ВЎаЕФЎаѕЧиНННЎЁТЎв»ГбЎГБ"
UNKNOWN_EXT = "%s%nа»з№»ГРаА·дБиГЩйЁСЎбЕРдБиКТБТГ¶·УЎТГбµЎдїЕмдґй"
INVALID_DIR = "%s%nдБиКТБТГ¶КГйТ§дїЕмдґй, в»ГґаЕЧНЎбїйБа»йТЛБТВ·Хи¶ЩЎµйН§"
EXTRACT_FAILED = "%s дБиКТБТГ¶бµЎдїЕмдґй%nґЩаЛБЧН№ЗиТБС№ЁРа»з№ %s, «Ци§¶ЩЎГН§ГСє, бµиБГЎТГјФґѕЕТґг№ЎТГбµЎдїЕм%nв»ГґґЩдїЕмєС№·ЦЎ, %s, КУЛГСєўйНБЩЕаѕЧиНаµФБ%n%nЎґ µЎЕ§ аѕЧиНбКґ§дїЕмєС№·ЦЎаґХлВЗ№Хй, ЛГЧН ВЎаЕФЎ аѕЧиНННЎЁТЎв»ГбЎГБ"

[Installer]
; Components page
COMP_DOCS = "ЗФёХЎТГгЄй§Т№бЕРўйНБЩЕўйНµЎЕ§г№ЎТГгЄй§Т№"
COMP_LANG = "дїЕмАТЙТКУЛГСєЎТГГН§ГСє№Т№ТЄТµФ"
COMP_ACE = "ГН§ГСєдїЕм ACE"
COMP_KGB = "ГН§ГСєдїЕм KGB"
COMP_PEA = "ГН§ГСєдїЕм Pea"
COMP_SIT = "ГН§ГСєдїЕм StuffIt"

; Preferences page
PREFS_CAPTION = "µСй§¤иТ¤СЗаЕЧНЎўН§в»ГбЎГБ"
PREFS_DESCRIPTION = "µСЗаЕЧНЎўН§ Universal Extractor µСЗдЛ№·Хи¤ШіµйН§ЎТГµСй§¤иТ?"
LANGUAGE_LABEL = "¤иТАТЙТБТµГ°Т№"
DEBUG_LABEL = "бїйБўН§дїЕм Debug"
PREFS_LABEL1 = "¤ШіКТБТГ¶µСйи§¤иТµСЗаЕЧНЎµТБґйиТ№ЕиТ§вґВЎТГ»ГСє¤иТБТµГ°Т№ўН§ЎТГ·У§Т№·СиЗд»ўН§ Universal Extractor"
PREFS_LABEL2 = "µСЗаЕЧНЎаЛЕиТ№ХйКТБТГ¶а»ЕХиВ№б»Е§дґйЛЕС§ЁТЎЎТГµФґµСй§бЕйЗвґВбЎйдўдґй·ХидїЕм UniExtract.ini."
APPEND_EXT_LABEL = "&ЁСґЎТГ№ТБКЎШЕўН§дїЕм·ХиЛТВд»"
HISTORY_LABEL = "&¤§¤иТ»ГРЗСµФўН§дїЕм"
REMOVE_DUPE_LABEL = "ЕєдїЕм&«йУ"
REMOVE_TEMP_LABEL = "ЕєдїЕм&ЄСиЗ¤ГТЗ"
WARN_EXECUTE_LABEL = "&аµЧН№ЎиН№ЁРКСи§дїЕм·У§Т№"

; Tasks page
HISTORY_LABEL = "&¤§¤иТ»ГРЗСµФўН§дїЕмєХєНСґ"
ASSOCIATE = "&а»ФґгЄйЎТГ·У§Т№ГиЗБЎСєаБ№Щ context ўН§ Explorer"
ASSOCIATE_FILES = "аѕФиБ UniExtract &дїЕм... ·ХиаБ№Щ context"
ASSOCIATE_HERE = "аѕФиБ UniExtract &·Хи№Хи ·ХиаБ№Щ context"
ASSOCIATE_SUBDIR = "аѕФиБ UniExtract д»ВС§б&їйБ ·ХиаБ№Щ context"
ASSOCIATE_FORCE = "єС§¤Сє &ЎТГ·У§Т№ГиЗБЎС№ўН§ГЩ»бєєдїЕм·ХиГН§ГСє"
MODIFY_PATH = "аѕФиБ Universal Extractor д»ВС§ &path ўН§ГРєєўН§¤Ші"
DESKTOP_ICON = "КГйТ§дН¤Н№·Хи &desktop"
QUICK_LAUNCH_ICON = "КГйТ§дН¤Н№ &Quick Launch"
SENDTO_ICON = "КГйТ§дН¤Н№г№ Send&To"

; Context Menu integration
EXTRACT_FILES = "UniExtract &дїЕм..."
EXTRACT_HERE = "UniExtract &·Хи№Хи"
EXTRACT_SUB = "UniExtract д»ВС§б&їйБ"
